-- MySQL dump 10.13  Distrib 8.0.28, for macos11 (x86_64)
--
-- Host: localhost    Database: csc4001
-- ------------------------------------------------------
-- Server version	8.0.28

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `users` (
  `userId` int NOT NULL,
  `userName` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  `score` int NOT NULL,
  PRIMARY KEY (`userId`),
  UNIQUE KEY `userId_UNIQUE` (`userId`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (0,'李向','123456',100),(1,'赵若','123456',127),(2,'陈若','123456',126),(3,'周蕾','123456',126),(4,'郑向山','123456',112),(5,'王绮平','123456',141),(6,'赵绮','123456',102),(7,'蒋文向','123456',118),(8,'杨文','123456',101),(9,'孙蕾天','123456',122),(10,'冯若','123456',132),(11,'朱烟白','123456',116),(12,'李曼','123456',139),(13,'陈白烟','123456',145),(14,'王斌','123456',139),(15,'郑绮','123456',114),(16,'周绮','123456',116),(17,'李文','123456',128),(18,'孙曼','123456',109),(19,'沈曼凡','123456',111),(20,'韩向','123456',136),(21,'冯白平','123456',122),(22,'孙凡凡','123456',100),(23,'蒋若','123456',108),(24,'郑秋向','123456',103),(25,'周书文','123456',135),(26,'钱若天','123456',135),(27,'杨若','123456',121),(28,'朱若','123456',116),(29,'王向','123456',102),(30,'秦绮','123456',103),(31,'钱秋平','123456',106),(32,'陈白绮','123456',138),(33,'杨平蕾','123456',124),(34,'朱文天','123456',101),(35,'郑蕾凡','123456',121),(36,'沈山','123456',144),(37,'吴文天','123456',119),(38,'吴凡','123456',108),(39,'朱书蕾','123456',124),(40,'杨蕾烟','123456',135),(41,'郑烟','123456',112),(42,'韩文','123456',137),(43,'郑天','123456',102),(44,'杨书烟','123456',116),(45,'郑书','123456',139),(46,'周平','123456',125),(47,'陈向','123456',148),(48,'朱凡蕾','123456',110),(49,'陈若','123456',133),(50,'秦烟白','123456',122),(51,'陈烟若','123456',116),(52,'赵山','123456',135),(53,'陈天天','123456',115),(54,'杨文','123456',120),(55,'杨文','123456',147),(56,'陈平','123456',139),(57,'杨烟','123456',103),(58,'冯凡秋','123456',132),(59,'钱凡','123456',102),(60,'秦烟向','123456',126),(61,'沈蕾','123456',138),(62,'赵从斌','123456',136),(63,'杨曼','123456',108),(64,'陈凡从','123456',141),(65,'朱曼','123456',134),(66,'钱秋若','123456',149),(67,'郑天','123456',135),(68,'赵天向','123456',145),(69,'王白','123456',106),(70,'蒋烟白','123456',125),(71,'朱曼','123456',123),(72,'孙向','123456',139),(73,'韩斌文','123456',105),(74,'赵从书','123456',144),(75,'钱从白','123456',100),(76,'王文','123456',103),(77,'杨曼','123456',106),(78,'郑绮平','123456',114),(79,'周斌','123456',119),(80,'杨文','123456',118),(81,'吴白白','123456',137),(82,'孙斌','123456',138),(83,'周平','123456',105),(84,'李绮天','123456',107),(85,'赵斌','123456',127),(86,'冯天山','123456',116),(87,'朱秋','123456',139),(88,'沈向','123456',102),(89,'赵天','123456',114),(90,'周斌','123456',145),(91,'钱从','123456',111),(92,'沈烟','123456',128),(93,'孙若','123456',142),(94,'沈文烟','123456',137),(95,'冯山凡','123456',133),(96,'赵平','123456',134),(97,'秦绮','123456',109),(98,'蒋斌','123456',135),(99,'周文若','123456',115);
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-04-16 12:33:27
